# -----------------------------------------------------------------------------------------------------------------
# 상속
# -----------------------------------------------------------------------------------------------------------------

# -----------------------------------------------------------------------------------------------------------------
# 같은 반 선생님과 학생의 공통적인 데이터 타입 => 클래스
# - 속성/필드
# 소속 학교, 반, 이름, 나이, 성별
# - 메서드
# 
# -----------------------------------------------------------------------------------------------------------------
class TnS:
    school='경상고등학교'
    clss='5반'
    
    def __init__(self,name,age,sex):
        self.name=name
        self.age=age
        self.sex=sex
# -----------------------------------------------------------------------------------------------------------------
# 선생님을 나타내는 데이터 타입 => 클래스
# - 속성/필드
# 소속 학교, 반, 담당 과목, 이름, 나이, 성별
# - 메서드
# 가르치다, 
# -----------------------------------------------------------------------------------------------------------------
class Teacher(TnS):
    # 클래스 속성

    # 인스턴스 속성
    def __init__(self,subject,name,age,sex):
        super().__init__(name,age,sex)
        self.subject=subject


    # 인스턴스 메서드
    def Teach(self):
        print(f'{self.name} 선생님이 {self.subject} 과목을 가르치다.')
# -----------------------------------------------------------------------------------------------------------------
# 학생을 나타내는 데이터 타입 => 클래스
# - 속성/필드
# 소속 학교, 반, 번호, 이름, 나이, 성별
# - 메서드
# 배우다, 
# -----------------------------------------------------------------------------------------------------------------
class Student(TnS):
    # 클래스 속성

    # 인스턴스 속성
    def __init__(self,name,age,sex,num):
        super().__init__(name,age,sex)
        self.num=num

    # 인스턴스 메서드
    def Learn(self):
        print(f'{self.name} 학생이 배우다.')

s1=Student('배트맨',12,'man',13)
print(s1.clss,s1.school)


# -----------------------------------------------------------------------------------------------------------------
# 매개변수 => 값, 가변값, 키=값 가변, 디폴트값
# -----------------------------------------------------------------------------------------------------------------
def calc(num1,num2,op='+'):
    if op=='+': return num1+num2
    elif op=='-': return num1-num2
    elif op=='*': return num1*num2
    elif op=='/': return num1/num2 if num2>0 else '0으로 나눌 수 없습니다.'

print(calc(10,2,'*'))
print(calc(10,2))